# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32
  - [200,100, 300,400, 500,300] 

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4   
   [-1, 3, C3, [128]],            # 2-C1
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8 
   [-1, 6, C3, [256]],            # 4-C2
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],            # 6-C3
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32 
   [-1, 3, C3, [1024]],           # 8-C4
   [-1, 1, SPPF, [1024, 5]],      # 9-SPPF
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                   # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 11
   [[-1, 6], 1, Concat, [1]],                    # 12
   [-1, 3, C3, [512, False]],                    # 13

   [-1, 1, Conv, [256, 1, 1]],                   # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 15
   [[-1, 4], 1, Concat, [1]],                    # 16
   [-1, 3, C3, [256, False]],                    # 17

   # Following block is added newly. See the corresponding figure.
   [-1, 1, Conv, [128, 1, 1]],                   # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 19
   [[-1, 2], 1, Concat, [1]],                    # 20 (concat with the first C3 output)
   [-1, 3, C3, [128, False]],                    # 21

   # Following block is added newly. See the corresponding figure.
   [-1, 1, Conv, [128, 3, 2]],                   # 22
   [[-1, 18], 1, Concat, [1]],                   # 23
   [-1, 3, C3, [256, False]],                    # 24

   [-1, 1, Conv, [256, 3, 2]],  # 25
   [[-1, 14], 1, Concat, [1]],  # 26
   [-1, 3, C3, [512, False]],   # 27

   [-1, 1, Conv, [512, 3, 2]],  # 28 
   [[-1, 10], 1, Concat, [1]],  # 29
   [-1, 3, C3, [1024, False]],  # 30

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
