# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   #[[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

# YOLOv5 v6.0 decoder
decoder:
  [[17, 1, Conv, [256, 3, 1, 1]],                  #80x80x256     24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #160x160x256   25
   [-1, 1, Conv, [64, 3, 1, 1]],                   #160x160x64    26

   [20, 1, nn.Upsample, [None, 2, 'nearest']],     #80x80x512     27
   [-1, 1, Conv, [256, 3, 1, 1]],                  #80x80x256     28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #160x160x256   29
   [-1, 1, Conv, [64, 3, 1, 1]],                   #160x160x64    30 

   [23, 1, nn.Upsample, [None, 2, 'nearest']],     #40x40x1024    31
   [-1, 1, Conv, [256, 3, 1, 1]],                  #40x40x256     32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #80x80x256     33
   [-1, 1, Conv, [64, 3, 1, 1]],                   #80x80x64      34
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #160x160x64    35

   [[26, 30], 1, Concat, [1]],                     #160x160x128   36
   [[-1, 35], 1, Concat, [1]],                     #160x160x192   37
   [-1, 1, Conv, [16, 3, 1, 1]],                   #160x160x16    38
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #320x320x16    39
   [-1, 1, Conv, [8, 3, 1, 1]],                    #320x320x8     40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #640x640x8     41
   [-1, 1, ConvLast, [3, 3, 1, 1]],                #640x640x3     42
  ]

